jQuery(function($) {

  /* コンポーネント以外の自作スクリプトはこの中へ記述します */
  /*============================================================*/



});

/* コンポーネント付随のスクリプトはこの下へ記述します */
/*============================================================*/


/* form113 */
/*--------------------------------------------------*/

(function($){

  $(document).ready(function(){
    $('.form113 input[name^="郵便番号"]').on('keyup change', function(e) {
      AjaxZip3.zip2addr('郵便番号[data][0]', '郵便番号[data][1]', '都道府県・市区町村', '都道府県・市区町村');
    });
  });

})(jQuery)
